package main

func main() {
	//1
	//Напишите функцию f(), которая будет принимать строку text и выводить ее (печатать на экране).
	//От вас требуется дописать только эту функцию, считайте что функция main() уже объявлена,
	//считывать с консоли ничего не нужно!
	//Пакет "fmt" уже импортирован!
	//Sample Input:
	//Hello!
	//Sample Output:
	//Hello!
	//F("Hello!")

	//2
	//Напишите функцию, находящую наименьшее из четырех введённых в этой же функции чисел.
	//Входные данные
	//Вводится четыре числа.
	//Выходные данные
	//Необходимо вернуть из функции наименьшее из 4-х данных чисел
	//Sample Input:
	//4 5 6 7
	//Sample Output:
	//4
	//fmt.Println(Min(4, 5, 6, 7))

	//3
	//Напишите "функцию голосования", возвращающую то значение (0 или 1),
	//которое среди значений ее аргументов x, y, z встречается чаще.
	//Входные данные
	//Вводится 3 числа - x, y и z (x, y и z равны 0 или 1).
	//Выходные данные
	//Необходимо вернуть значение функции от x, y и z.
	//Sample Input:
	//0 0 1
	//Sample Output:
	//0
	//fmt.Println(Vote(1, 0, 1))

	//4
	//Последовательность Фибоначчи определена следующим образом: φ1=1, φ2=1, φn=φn-1+φn-2 при n>1.
	//Начало ряда Фибоначчи выглядит следующим образом: 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, ...
	//Напишите функцию, которая по указанному натуральному n возвращает φn.
	//Входные данные
	//Вводится одно число n.
	//Выходные данные
	//Необходимо вывести  значение φn.
	//Sample Input:
	//4
	//Sample Output:
	//3
	//fmt.Println(FibNumWithIndx(4))

	//5
	//Напишите функцию sumInt, принимающую переменное количество аргументов типа int,
	//и возвращающую количество полученных функцией аргументов и их сумму. Пакет "fmt" уже импортирован,
	//функция и пакет main объявлены.
	//Пример вызова вашей функции:
	//a, b := sumInt(1, 0)
	//fmt.Println(a, b)
	//Результат: 2, 1
	//fmt.Println(SumNumbers(2, 1))
}
