package main

func main() {
	//1
	//На вход подаются a и b - катеты прямоугольного треугольника. Нужно найти длину гипотенузы
	//Sample Input:
	//6 8
	//Sample Output:
	//10
	//fmt.Println(FindHypotenuse(6, 8))

	//2
	//Дана строка, содержащая только английские буквы (большие и маленькие).
	//Добавить символ ‘*’ (звездочка) между буквами (перед первой буквой и после последней символ ‘*’ добавлять не нужно).
	//Входные данные
	//Вводится строка ненулевой длины. Известно также, что длина строки не превышает 1000 знаков.
	//Выходные данные
	//Вывести строку, которая получится после добавления символов '*'.
	//Sample Input:
	//LItBeoFLcSGBOFQxMHoIuDDWcqcVgkcRoAeocXO
	//Sample Output:
	//L*I*t*B*e*o*F*L*c*S*G*B*O*F*Q*x*M*H*o*I*u*D*D*W*c*q*c*V*g*k*c*R*o*A*e*o*c*X*O
	//fmt.Println(AddSep("LItBeoFLcSGBOFQxMHoIuDDWcqcVgkcRoAeocXO", "*"))

	//3
	//Дана строка, содержащая только десятичные цифры. Найти и вывести наибольшую цифру.
	//Входные данные
	//Вводится строка ненулевой длины. Известно также, что длина строки не превышает 1000 знаков и
	//строка содержит только десятичные цифры.
	//Выходные данные
	//Выведите максимальную цифру, которая встречается во введенной строке.
	//Sample Input:
	//1112221112
	//Sample Output:
	//2
	//fmt.Println(MaxNum(1112221112))

	//4
	//На вход подается целое число. Необходимо возвести в квадрат каждую цифру числа и вывести получившееся число.
	//Например, у нас есть число 9119. Первая цифра - 9. 9 в квадрате - 81. Дальше 1. Единица в квадрате - 1. В итоге получаем 811181
	//Sample Input:
	//9119
	//Sample Output:
	//811181
	//fmt.Println(Program4(9119))

	//5
	//
}
